blog/app/controllers/articles_controller.rb

    def create
    #     render plain: params[:article].inspect
    # @article = Article.new(params[:article])
    # @article = Article.new(params.require(:article).permit(:title, :text))
        # @article = Article.new(article_params)

        # @article.save
        # redirect_to @article

        @article = Article.new(article_params)

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hello World!"], ["text", "This is another test run"], ["created_at", "2020-09-21 23:24:02.005674"], ["updated_at", "2020-09-21 23:24:02.005674"]]